app/Validations/UserRules.php

    public function  validateUser(string $str,string $fields, array $data, ?string &$error = null): bool
    {
        $model = new UserModel();
        $user = $model->where(['email'=>$data['email'], 'type'=>$data['type']])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'kafiju@mailinator.com'
AND `type` = 'customer'
 LIMIT 1