app/Validations/UserRules.php

SELECT *
FROM `agencies`
WHERE `email` = 'bevemuf@mailinator.com'
 LIMIT 1
SELECT *
FROM `customers`
WHERE `email` = 'maj@mailinator.com'
 LIMIT 1
---
    public function  validateUser(string $str,string $fields, array $data, ?string &$error = null): bool
    {
        if($data['type']=='agency')
        $model = new AgencyModel();
        else if($data['type']=='customer')
        $model = new CustomerModel();

        $user = $model->where('email',$data['email'])->first();