app/Controllers/Agency.php

SELECT *
FROM `cars`
WHERE `agency_id` = '4'
---
    public function viewCars(){
        if(session()->get('type')!='agency')
        return redirect()->to('/');
        $model=new CarModel();
        $allCars=$model->where('agency_id',session()->get('id'))->get()->getResultArray();