app/Controllers/Home.php

            }
        }
        $model = new CarModel();
        $cars = $model->findAll();
---
SELECT *
FROM `cars`